<?php 
   $up = $_GET['up'];
   $down= $_GET['down'];
   echo "ค่าบน = ".$up.",\tค่าล่าง = ".$down."<br>";

//ค่าบน
   if ($up <= 120) {
        echo "ความอันตราย : ปกติ";
   } else if ($up >= 121 && $up <= 139) {
        echo "ความอันตราย : ค่อนข้างสูง";
   }else if($up >= 140 && $up <= 159) {
        echo "ความอันตราย : สูง";
   }else{
        echo "ความอันตราย : สูงมาก" ;
   }

//ค่าล่าง  
   if ($down <= 80) {
        echo "<br>ผลวัดความดัน/ข้อแนะนำ : ตรวจเช็คความดันโลหิตอย่างสม่ำเสอ";
   } else if ($down >= 80 && $down <= 89) {
        echo "<br>ผลวัดความดัน/ข้อแนะนำ : ปรึกษาแพทย์";
   }else if($down >= 90 && $down <= 99) {
        echo "<br>ผลวัดความดัน/ข้อแนะนำ : พบแพทย์" ;
   }else {
        echo "<br>ผลวัดความดัน/ข้อแนะนำ : พบแพทย์ด่วน";
   }
?>
